python manage.py shell  #инициировал django shell
from news.models import *  #инициировал все модели из приложения news, входящего в проект

# 1. Создать двух пользователей (с помощью метода User.objects.create_user('username')).
user1 = User.objects.create_user(username='Alexey', email='alexey@etc.com', password=None)
user2 = User.objects.create_user(username='Ivan', email='ivan@cta.com', password='ivanivan')
# 2. Создать два объекта модели Author, связанные с пользователями.
Author.objects.create(author=user1)
Author.objects.create(author=user2)
# 3. Добавить 4 категории в модель Category.
Category.objects.create(category_name='спорт')
Category.objects.create(category_name='политика')
Category.objects.create(category_name='бизнес')
Category.objects.create(category_name='техника')
# 4. Добавить 2 статьи и 1 новость.
Post.objects.create(author=Author(id=1), title='CAS вынес решение по вопросу участия Эквадора в ЧМ по футболу', text='Спортивный арбитражный суд (CAS) лишил сборную Эквадора трех очков в отборочном турнире на чемпионат мира по футболу 2026 года за использование документа, содержащего ложную информацию об игроке Байроне Кастильо. Об этом во вторник сообщила пресс-служба CAS. 5 мая Федерация футбола Чили подала иск с требованием исключить сборную Эквадора из числа участников чемпионата мира 2022 года в Катаре в связи с тем, что Кастильо является колумбийцем и играет с поддельным паспортом. Чилийская федерация потребовала, чтобы эквадорскую команду лишили очков, набранных в восьми квалификационных матчах, в которых принимал участие Кастильо, при этом соперники автоматически должны были получить по три очка за игру. 11 мая стало известно, что Международная федерация футбола (ФИФА) открыла дисциплинарное разбирательство в отношении Кастильо, однако 10 июня дисциплинарный комитет организации закрыл дело, возбужденное против Эквадорской федерации футбола. Во время заседания CAS были рассмотрены и аргументы представителей Федерации футбола Перу, которая тоже подала апелляцию на решение ФИФА.')
Post.objects.create(author=Author(id=2), title='В России появился научный конкурс для школьников', text='Всероссийский конкурс «Знаешь? Научи!» проводится уже во второй раз. В первом сезоне, состоявшемся в 2021 году, на проект зарегистрировались 37 тысяч человек: всего было прислано 3,5 тысячи видеороликов. Темы варьировались — это продемонстрировало широкий круг увлечений и интересов среди участников. Больше всего школьники интересовались химией, физикой, биологией, экологией, математикой и информационными технологиями. Победительница в категории «Старшая школа» Елизавета Слесарева посвятила свой видеоролик химическим индикаторам и их применению в промышленности. В будущем она хочет стать медиком и совмещать постоянную медицинскую работу с научной практикой. Первоклассница Вероника Кишова, ставшая лучшей в категории «Младшая школа», продемонстрировала собственную мини-ферму и на ее примере наглядно объяснила, как вылупляются цыплята, чем они питаются и почему куры являются самой распространенной домашней птицей на земле. В категории «Средняя школа» победу праздновал Дмитрий Марков, продемонстрировавший принцип работы динамика и эксперименты со звуком в домашних условиях. Победителей определяли не только в возрастных категориях, но и в тематических номинациях «Естественные науки», «Информационные технологии и точные науки», «Место человека во Вселенной», «Общественные и гуманитарные науки», «Науки будущего». Так, в номинации «Информационные технологии и точные науки» выиграл первоклассник, собравший из конструктора принтер, управляемый через смартфон.')
Post.objects.create(author=Author(id=2), kind='NE', title='Акции Tesla упали вдвое из-за того, что Маск купил Twitter', text='Процедура приобретения «Твиттера» Илоном Маском началась в апреле 2022 года и завершилась 27 октября. Предприниматель заплатил за сервис микроблогов $44 млрд, но при этом совокупная стоимость его активов с апреля по начало ноября снизилась на $74 млрд, пишет Forbes. Акции «Теслы» также обрушились. Аналитики полагают, что причина — именно в покупке «Твиттера». Инвесторы избавляются от акций Tesla в связи с тем, что Маск стал больше уделять внимание развитию Twitter, чем электромобильному направлению. Во вторник 8 ноября состояние Маска опустилось ниже $200 млрд. Впрочем, он все еще остается самым богатым человеком в мире, почти на 40 миллиардов долларов опережая владельца компании Louis Vuitton Бернара Арно. Акции Tesla с апреля подешевели почти вдвое и продолжают падать. Так, с начала ноября они опустились с $227 до $187 за акцию. В апреле до новостей о покупке «Твиттера» за акцию давали $377.')
# 5.Присвоить им категории (как минимум в одной статье/новости должно быть не меньше 2 категорий).
Post.objects.get(id=1).category.add(Category.objects.get(id=1))
Post.objects.get(id=1).category.add(Category.objects.get(id=2))
Post.objects.get(id=2).category.add(Category.objects.get(id=4))
Post.objects.get(id=3).category.add(Category.objects.get(id=3))
# 6. Создать как минимум 4 комментария к разным объектам модели Post (в каждом объекте должен быть как минимум один комментарий).
Comment.objects.create(post=Post(id=1), author=User(id=1), text = 'Меньше конкурентов могло бы быть у сборной России')
Comment.objects.create(post=Post(id=1), author=User(id=2), text = 'Да всё равно бы из группы не вышли')
Comment.objects.create(post=Post(id=2), author=User(id=1), text = 'Готов всячески содействовать подобным начинаниям')
Comment.objects.create(post=Post(id=3), author=User(id=1), text = 'Лучше бы что-нибудь новое написали про отношения Илона Маска и Эмбер Хёрд')
# 7. Применяя функции like() и dislike() к статьям/новостям и комментариям, скорректировать рейтинги этих объектов.
Post.objects.get(id=1).like()
Post.objects.get(id=1).like()
Post.objects.get(id=1).dislike()
Post.objects.get(id=1).like()
Post.objects.get(id=1).like()
Post.objects.get(id=2).like()
Post.objects.get(id=2).like()
Post.objects.get(id=2).like()
Post.objects.get(id=3).dislike()
Post.objects.get(id=3).dislike()
Post.objects.get(id=3).dislike()
Comment.objects.get(text='Меньше конкурентов могло бы быть у сборной России').like()
Comment.objects.get(text='Меньше конкурентов могло бы быть у сборной России').dislike()
Comment.objects.get(text='Да всё равно бы из группы не вышли').like()
Comment.objects.get(text='Да всё равно бы из группы не вышли').like()
Comment.objects.get(text='Готов всячески содействовать подобным начинаниям').like()
Comment.objects.get(text='Готов всячески содействовать подобным начинаниям').like()
Comment.objects.get(text='Готов всячески содействовать подобным начинаниям').like()
Comment.objects.get(text='Готов всячески содействовать подобным начинаниям').like()
Comment.objects.get(text='Готов всячески содействовать подобным начинаниям').like()
Comment.objects.get(id=4).dislike()
Comment.objects.get(id=4).dislike()
Comment.objects.get(id=4).dislike()
Comment.objects.get(id=4).dislike()
Comment.objects.get(id=4).dislike()
Comment.objects.get(id=4).dislike()
# 8. Обновить рейтинги пользователей.
Author.objects.get(id=1).update_rating()
Author.objects.get(id=2).update_rating()
# 9. Вывести username и рейтинг лучшего пользователя (применяя сортировку и возвращая поля первого объекта).
a_best = Author.objects.order_by('-rate').first()
a_best.author.username
a_best.rate
# 10. Вывести дату добавления, username автора, рейтинг, заголовок и превью лучшей статьи, основываясь на лайках/дислайках к этой статье.
post_best = Post.objects.order_by('-rate').first()
post_best.add_date.strftime('%d.%m.%Y')
post_best.author.author.username
post_best.rate
post_best.title
post_best.preview()
# 11. Вывести все комментарии (дата, пользователь, рейтинг, текст) к этой статье.
post_best_all_comms = Comment.objects.filter(post=post_best)
for i in post_best_all_comms:
    i.add_datetime.strftime('%d.%m.%Y')
    i.author.username
    i.rate
    i.text
