Repository: Aleksets/SkillFactory-D2.9-Zaplatin
Catalog: newsportal/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Category
ru: Категория

source: Later than specified date
ru: Позже указанной даты

source: Title must be at least 20 characters!
ru: Заголовок должен быть не менее 20 символов!

source: The text must not match the title!
ru: Текст не должен совпадать с заголовком

source: Delete news in the specified category
ru: Удалить новости указанной категории

source: You didn't specify a category
ru: Вы не указали категорию

source: List of categories
ru: Список категорий

source: Category(s)
ru: Категория(ии)

source: absent
ru: отсутствует(ют)

source: Do you really want to delete all news in
ru: Вы точно хотите удалить все новости в

source: category? Yes/no
ru: категории? Да/нет

source: Yes
ru: Да

source: News in category(s)
ru: Новости в категории(ях)

source: removed successfully
ru: успешно удалены

source: You have not confirmed the deletion of news
ru: Вы не подтвердили удаление новости(ей)

source: Article
ru: Статья

source: News
ru: Новость

source: News for the past week
ru: Новости за прошедшую неделю

source: Thank you for registering,
ru: Спасибо за регистрацию,

source: Follow
ru: Перейти

source: the link
ru: по ссылке

source: to activate your account.
ru: для активации Вашего аккаунта

source: Confirmation of registration
ru: Подтверждение регистрации

source: Censorship can only be applied to text
ru: Цензурирование может быть применено только к тексту

source: You have successfully subscribed to the newsletter in the category
ru: Вы успешно подписались на получение новостей в категории

source: You have successfully unsubscribed from the newsletter in the category
ru: Вы успешно отписались от получения новостей в категории

source: Error 403
ru: Ошибка 403

source: You definitely don't have access to this page...
ru: Вы определенно не имеете доступ к этой странице...

source: If you are already logged in, you may need to contact the site administrator.
ru: Если Вы успешно вошли на сайт, возможно, Вам стоит обратиться к администратору.

source: If you are not registered on the site, you are welcome:
ru: Если Вы не зарегистрированы на сайте, предлагаем Вам это сделать:

source: Register on the site
ru: Зарегистрироваться на сайте

source: If you are not yet authorized on the site, we suggest you do this:
ru: Если Вы не авторизованы на сайте, рекомендуем это сделать:

source: Authorize to the site
ru: Авторизация на сайте

source: Enter or register
ru: Войти или зарегистрироваться

source: Sign out
ru: Выйти из аккаунта

source: News list
ru: Список новостей

source: News search
ru: Поиск по новостям

source: Create news/article
ru: Создать новость/статью

source: Hello,
ru: Здравствуй,

source: ! New article in your favorite category
ru: Новая статья в твоем любимом разделе

source: News and articles
ru: Новости и статьи

source: Total at the moment:
ru: Всего на текущий момент:

source: Title
ru: Заголовок

source: Publication date
ru: Дата публикации

source: Preview
ru: Превью

source: Actions
ru: Действия

source: Change
ru: Изменить

source: Delete
ru: Удалить

source: No news!
ru: Новостей нет!

source: Total news found:
ru: Всего найдено новостей:

source: There are no news matching the specified search criteria!
ru: Не найдено новостей в соответствии с Вашим запросом

source: News/article
ru: Новость/статья

source: Subscribe to category
ru: Подписаться на категорию

source: You are already subscribed to the category
ru: Вы уже подписаны на категорию

source: Unsubscribe
ru: Отписаться

source: Deleting a news/article
ru: Удаление новости/статьи

source: Adding/changing news/article
ru: Создание/изменение новости/статьи

source: You can't publish more than three news per day!
ru: Вы не можете публиковать больше трех новостей в день!

source: Back to
ru: Вернуться к

source: news list
ru: списку новостей

source: Subscribe to a category
ru: Подписаться на категорию

source: Go to news page
ru: Перейти на страницу новости

source: Category unsubscribe
ru: Отписаться от категории

source: News for the past week in the category
ru: Новости за прошедшую неделю в категории
